#!/bin/bash
# -------------------------------------------------------------------
# lyr_Test.sh
# -------------------------------------------------------------------

#--------------------------------------------------------------------------------
# procedure Hello ()
#--------------------------------------------------------------------------------
function Hello() {
#beginfunction
    # аргументы
    echo $1
    echo $2
    echo $3
    # глобальная переменная
    global=5
    # локальная переменная
    local temp=5
    # ---------------------------
    echo 'hello world'
    # Команда return, прописываемая внутри функции, позволяет вернуть ее целочисленное значение
    # в виде кода завершения
    return 0
}
#endfunction

#:begin
    echo '---------------------------------------------'
    echo ' lyr_Test.sh '
    echo '---------------------------------------------'

    # -----------------------
    # Вывод функции
    # -----------------------
    Hello

    # -----------------------
    # присваиваем переменной parametr1 значение первого параметра скрипта
    # -----------------------
    PathName=$1

    # -----------------------
    # присваиваем переменной script_name значение имени скрипта
    # -----------------------
    script_name=$0

#:Exit
#--------------------------------------------------------------------------------
