#!/bin/bash
# -------------------------------------------------------------------
# lyrfd_CREATE_mnt_DATA.sh
# -------------------------------------------------------------------

#begin
    # ------------------------------------------------------------------
    # Создаем каталог /mnt/DATA
    # ------------------------------------------------------------------
    directory=/mnt/DATA
    if [[ ! -d $directory ]] ; then
        echo ---------------------------------------------
        echo create $directory
        echo ---------------------------------------------
        sudo rm -R $directory
        sudo mkdir -p $directory
        # Задаем владельца на созданный каталог
        sudo chown -R lyr:lyr /mnt/DATA
        # Задаем права на созданный каталог
        sudo chmod -R 777 $directory
    fi

#end
