#!/bin/bash
# -------------------------------------------------------------------
# lyrnet_samba_firewall.sh
# -------------------------------------------------------------------

#begin
    # --------------------------------------------
    # Настройка брандмауэра (firewall)
    # --------------------------------------------
    # По умолчанию, в системах на базе Debian брандмауэр
    # разрешает все соединения. Но если в нашем случае
    # мы используем брандмауэр, необходимо открыть порты:
    # 445 используется для samba
    # 137, 138 и 139 - для работы NetBIOS (использование имени компьютера для доступа)
    # --------------------------------------------
    sudo iptables -I INPUT -p tcp --dport 445 -j ACCEPT
    sudo iptables -I INPUT -p udp --dport 137:138 -j ACCEPT
    sudo iptables -I INPUT -p tcp --dport 139 -j ACCEPT

    # --------------------------------------------
    # Применяем настройки
    # --------------------------------------------
    #sudo apt-get update && sudo apt-get install iptables-persistent
    sudo apt update && sudo apt install iptables-persistent

    sudo netfilter-persistent save

#end

#--------------------------------------------------------------------------------
