#!/bin/bash
# -------------------------------------------------------------------
# lyrnet_samba_crony.sh
# -------------------------------------------------------------------

#begin
    # --------------------------------------------
    # синхронизации времени
    # --------------------------------------------
    # Установка демона chrony
    # --------------------------------------------
    #sudo apt-get update && sudo apt-get install chrony
    sudo apt update && sudo apt install chrony

    # --------------------------------------------
    # Разрешение автозапуска сервиса chrony
    # --------------------------------------------
    sudo systemctl enable chrony

#end

#--------------------------------------------------------------------------------
