#!/bin/bash
# -------------------------------------------------------------------
# lyrfd_CREATE_TOOLS_SH.sh
# -------------------------------------------------------------------

#begin
    # ------------------------------------------------------------------
    cd /home/lyr/TOOLS
    
    git clone git@github.com:lisitsinyr/TOOLS_SH.git

    # ------------------------------------------------------------------
    # u+x - разрешить выполнение для владельца
    # ------------------------------------------------------------------
    find /home/lyr/TOOLS/ -type f -iname *.sh -exec chmod u+x {} \;

#end
