#!/bin/bash
# -------------------------------------------------------------------
# lyrfd_CR_mnt_DATA.sh
# -------------------------------------------------------------------

#begin
    # ------------------------------------------------------------------
    # Создаем каталог /mnt/DATA
    # ------------------------------------------------------------------
    sudo mkdir -p /mnt/DATA
    cd /home/lyr/TOOLS
    # Задаем права на созданный каталог
    sudo chmod -R 770 /mnt/DATA
    # Задаем владельца на созданный каталог
    sudo chown -R lyr:lyr /mnt/DATA

#end
