#!/bin/bash
# -------------------------------------------------------------------
# lyrfd_CR_TOOLS.sh
# -------------------------------------------------------------------

#begin
    echo '---------------------------------------------'
    echo ' create /home/lyr/TOOLS '
    echo '---------------------------------------------'

    # ------------------------------------------------------------------
    # Создаем каталог /home/lyr/PROJECTS_LYR
    sudo mkdir -p /home/lyr/TOOLS
    cd /home/lyr/TOOLS
    # Задаем права на созданный каталог
    sudo chmod -R 770 /home/lyr/TOOLS
    # Задаем владельца на созданный каталог
    sudo chown -R lyr:lyr /home/lyr/TOOLS

#end
