#!/bin/bash
# -------------------------------------------------------------------
# lyrfd_CR_LOGS.sh
# -------------------------------------------------------------------

#begin
    echo ---------------------------------------------
    echo create /home/lyr/LOGS
    echo ---------------------------------------------

    # ------------------------------------------------------------------
    # Создаем каталог /home/lyr/LOGS
    # ------------------------------------------------------------------
    sudo mkdir -p /home/lyr/LOGS
    cd /home/lyr/LOGS
    # Задаем права на созданный каталог
    sudo chmod -R 770 /home/lyr/LOGS
    # Задаем владельца на созданный каталог
    sudo chown -R lyr:lyr /home/lyr/LOGS

#end
